app/controllers/comments_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
INSERT INTO "comments" ("username", "body", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["username", "Markus"], ["body", "Hello, nice post"], ["post_id", 2], ["created_at", "2022-07-07 13:18:47.657799"], ["updated_at", "2022-07-07 13:18:47.657799"]]
---
  def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.create(comment_params)